AcRxEnumTag.subAlternateLocalName
Derived class can override this method to provide custom implementation.
Returns:
Returns AcString object that contains the name

AcRxEnumTag.Dispose
Destructor

AcRxEnumTag.alternateLocalName
Returns a localized string representation of the
enumeration constant, if available. If the member has
alternate localized name attribute, then it tries to return
the alternate localized string representation using the
AcRxAlternateLocalizedNameAttribute information.
Returns:
Returns AcString object that contains the name

AcRxEnumTag.value
Returns the value of the enumeration constant.
Returns:
Returns const reference to an AcRxValue value

AcRxEnumTag.#ctor(System.Char!System.Runtime.CompilerServices.IsConst*,AcRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor
name:
The text that is used for the string representation of the constant.
value:
The value of the enumeration constant.

AcRxEnumTag
This class is used to store the enumeration constant value.